    
<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>


# Include the custom write command script.

$WriteExtScript = "$PSScriptRoot\Dependencies\AsciiProgressBar.ps1"
. "$WriteExtScript"

$PresedKeysScript = "$PSScriptRoot\Dependencies\Test-PresedKeys.ps1"
. "$PresedKeysScript"
$WaitForKeyPressScript = "$PSScriptRoot\Dependencies\Invoke-WaitForKeyPress.ps1"
. "$WaitForKeyPressScript"



Invoke-WaitForKeyPress 10